In [19]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

## Importamos nuestro csv 'actor' para chequeo de valores nulos y duplicados

In [20]:
data_ori = pd.read_csv('/Users/christelllameda/ironhack/Proyecto-Nro-2/data/actor.csv', encoding='latin1')

data = data_ori.copy()

In [21]:
data.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

## Chequeamos duplicados en las columnas 'first_name' y 'last_name' y observamos que se repite un actor, por lo que eliminamos esa fila

In [22]:
duplicates = data[data.duplicated(subset=['first_name', 'last_name'], keep=False)]

In [23]:
duplicates

     actor_id first_name last_name          last_update
100       101      SUSAN     DAVIS  2006-02-15 04:34:33
109       110      SUSAN     DAVIS  2006-02-15 04:34:33

In [24]:
data = data.drop(109)

## La columna last_update posee los mismos valores para todas las filas, por lo que no es relevante y la eliminamos

In [25]:
data = data.drop(columns=['last_update'])

In [26]:
data.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

## Exportamos nuestro archivo limpio

In [27]:
data.to_csv('actor_clean.csv', index=False)